{
  "courses": [
    {
      "name": "Java",
      "description": "Build solid foundations in Java syntax, OOP, and problem solving.",
      "topics": [
        {
          "name": "Type Casting and Conversion",
          "questions": [
            "Write a program that takes an int input and automatically converts it into a double. Print both values to demonstrate widening conversion.",
            "Given a double value, cast it into an int. Print the original double and the converted int to show narrowing conversion.",
            "Read a character from the user, convert it into its ASCII integer value using type casting, and print both values.",
            "Given an integer between 65 and 90, convert it into a character using casting. Print both the integer and the character.",
            "Take an int value greater than 127, cast it into a byte, and print the result. Explain why the value changes due to overflow.",
            "Write a program that reads a floating-point number with decimals, casts it into an int, and prints the difference between the original and converted values.",
            "Read a large long value, cast it into an int, and print the result. Test with values greater than Integer.MAX_VALUE and observe the behavior.",
            "Take an integer and cast it into a short. Print the result and check whether data loss occurs for values outside the short range.",
            "Given a double value with a decimal part, cast it into a byte and print the result. Explain the observed behavior.",
            "Given int a = 5 and double b = 6.7, perform a + b and store the result in a double and an int (using explicit casting). Print both results.",
            "Given a numeric string \"12345\", convert it into an integer using Integer.parseInt() and perform an arithmetic operation on it.",
            "Given an integer, convert it into a string using String.valueOf() and print both the integer and the string.",
            "Attempt to cast a boolean value to an int directly. Explain why Java does not allow casting boolean to numeric types.",
            "Write a program that adds a byte and a short. Observe the result type and explain arithmetic type promotion in Java.",
            "Write a program that takes a double value, casts it to an int, then casts it to a char. Print all three values.",
            "Given two integers a and b, demonstrate the difference between a / b and (double) a / b.",
            "Write a program that multiplies an int with a float, stores the result in a float, and prints the output to show implicit casting in expressions.",
            "Given two double values, cast both to integers before addition and print the result. Compare it with normal double addition."
          ]
        },
        {
          "name": "Variables (Static and Instance)",
          "questions": [
            "Create a class College with a static variable collegeName. Assign and print it inside main().",
            "Write a class Library with static variables totalBooks and librarianName. Assign values and print them without creating any object.",
            "Create a class Bank with a static variable bankName. Change its value twice inside main() and print each time.",
            "Create a class Hospital with two static variables: hospitalName and location. Assign and display them directly.",
            "Write a class Company with a static variable CEO. Assign a value and print it without using any object.",
            "Create a class Vehicle with a static variable numberOfWheels = 4. Print it directly in main() using the class name.",
            "Make a class TV with static variables brand and screenType. Assign and display values.",
            "Create a class Airline with a static variable flightCodePrefix. Assign it once and use it in two print statements.",
            "Write a class Phone with a static variable manufacturer. Assign and print using the class name.",
            "Create a class City with static variables country and timezone. Assign values and print them without object creation.",
            "Create a class Student with an instance variable studentName. Create two objects and assign different names to each. Print them.",
            "Write a class Pen with an instance variable color. Assign and print the color using two different pen objects.",
            "Create a class Book with instance variables title and author. Create a book object, assign values, and print them.",
            "Write a class Laptop with instance variables model and price. Assign and print values for two objects.",
            "Create a class Room with an instance variable roomNumber. Create three objects and assign unique numbers to each.",
            "Write a class Employee with an instance variable employeeName. Create two employees and assign different names. Print them.",
            "Create a class Animal with an instance variable animalType. Create objects like Dog and Cat, assign their types, and print them.",
            "Make a class Mobile with instance variables brand and model. Assign and print values for two different objects.",
            "Create a class Fan with an instance variable speed. Assign different speeds for different fan objects and print them.",
            "Write a class Car with an instance variable color. Create three car objects, assign three different colors, and print all values."
          ]
        },
        {
          "name": "Arithmetic Operators",
          "questions": [
            "Write a program to add two numbers.",
            "Write a program to subtract one number from another.",
            "Write a program to multiply two numbers.",
            "Write a program to divide two numbers and display the quotient.",
            "Write a program to find the modulo (remainder) of two numbers.",
            "Write a program to calculate the area of a circle using the formula πr².",
            "Write a program to calculate simple interest using the formula (P × R × T) / 100.",
            "Write a program to calculate the average of three numbers.",
            "Write a program to convert temperature from Celsius to Fahrenheit."
          ]
        },
        {
          "name": "Unary Operators",
          "questions": [
            "Write a program to demonstrate pre-increment (++a) and post-increment (a++), and print the values before and after increment.",
            "Write a program to demonstrate pre-decrement (--a) and post-decrement (a--), and observe the difference in behavior.",
            "Write a program to swap two numbers using only addition (+) and subtraction (-) operators.",
            "Write a program to swap two numbers using multiplication (*) and division (/) operators.",
            "Write a program to convert a positive number to negative and a negative number to positive using the unary minus (-) operator.",
            "Write a program to count the number of digits in an integer using a loop and unary operators.",
            "Write a program to check and explain increment behavior inside a for loop using the ++ operator.",
            "Write a program to compare prefix and postfix increment when used inside expressions.",
            "Write a program that chains increment and decrement operators in a single statement and explains the output.",
            "Write a program to simulate a counter using unary increment (++) and decrement (--) operators."
          ]
        },

        {
          "name": "Relational (Comparison) Operators",
          "questions": [
            "Write a program to check whether two numbers are equal or not using relational operators.",
            "Write a program to check if one number is greater than another.",
            "Write a program to check whether a given number lies within a specified range.",
            "Write a program to compare three numbers and find the largest among them.",
            "Write a program to check if a number is smaller than all other given numbers.",
            "Write a program to check whether a given character is uppercase or lowercase using relational operators.",
            "Write a program to validate a password by checking if its length is greater than or equal to a required minimum length.",
            "Write a program to determine whether a student has passed or failed an exam based on marks using comparison operators.",
            "Write a program to check whether a number is even using the modulo operator and a relational comparison.",
            "Write a program to check whether a given number is a three-digit number."
          ]
        },
        {
        "name": "Logical Operators",
        "questions": [
          "Write a program to check if a number lies between 10 and 50 using the && operator.",
          "Write a program to check whether a given year is a leap year using multiple logical conditions.",
          "Write a program to check whether a character is a vowel or a consonant using the || operator.",
          "Write a program to validate login credentials by checking correct username and password using the && operator.",
          "Write a program to check if a number is divisible by both 3 and 5 using logical operators.",
          "Write a program to determine whether a number is either positive or even using the || operator.",
          "Write a program to determine if a number is valid and divisible by 10 using the && operator.",
          "Write a program to demonstrate the use of the ! (NOT) operator to reverse a boolean condition.",
          "Write a program to check if a number is not within a given range using logical operators.",
          "Write a program that uses both && and || together to perform a multiple-condition check."
        ]
      },
      {
        "name": "Assignment Operators",
        "questions": [
          "Write a program that uses the += operator to sum all values in a loop.",
          "Write a program that uses the *= operator to calculate the power of a number.",
          "Write a program that uses the /= operator to repeatedly reduce a number by half.",
          "Write a program that uses the -= operator to perform a countdown from a given number.",
          "Write a program that uses the %= operator to iteratively extract the last digit of a number.",
          "Write a program that uses multiple compound assignment operators together in a single expression.",
          "Build a simple calculator program using only compound assignment operators.",
          "Write a program to perform matrix addition using the += operator.",
          "Write a program to calculate the cumulative total of array elements using the += operator.",
          "Write a program to generate a table of squares using the *= operator."
        ]
      },
      {
        "name": "Ternary Operator",
        "questions": [
          "Write a program to check whether a number is even or odd using the ternary operator.",
          "Write a program to find the maximum of two numbers using the ternary operator.",
          "Write a program to find the maximum of three numbers using nested ternary operators.",
          "Write a program to print \"Pass\" or \"Fail\" based on marks using the ternary operator.",
          "Write a program to assign a grade based on score using chained ternary operators.",
          "Write a program to find the smallest of two numbers using the ternary operator.",
          "Write a program to check whether a year is a leap year using the ternary operator.",
          "Write a program to print whether a number is positive, negative, or zero using the ternary operator.",
          "Write a program to determine voting eligibility using the ternary operator.",
          "Write a program to return \"YES\" or \"NO\" if a number is divisible by 7 using the ternary operator."
        ]
      },
      {
        "name": "IF Conditions Programs",
        "questions": [
          "Write a program to accept two integers and check whether they are equal or not.",
          "Write a program to check whether a number is divisible by another number or not.",
          "Write a program to determine whether a person is eligible for casting vote or not.",
          "Write a program to check whether a number is even or odd.",
          "Write a program to check whether a number is even or odd without using if-else.",
          "Write a program to check whether a number is positive, negative, or zero.",
          "Write a program to check which number is bigger among two numbers.",
          "Write a program to check which number is bigger among three numbers.",
          "Write a program to check whether a year is a leap year or not.",
          "Write a program to check whether a number is a Buzz number or not.",
          "Write a program to determine whether a person is a kid, teenager, adult, or old age based on age.",
          "Write a program to display the weekday name for numbers 1 to 7.",
          "Write a program to display a wish message to the user based on time.",
          "Write a program to display pass or fail based on marks.",
          "Write a program to display weather conditions based on temperature ranges.",
          "Write a program to calculate price per copy and total price for printed copies based on given slabs.",
          "Write a program to check whether an entered character is lowercase or uppercase.",
          "Write a program to convert a lowercase character into an uppercase character.",
          "Write a program to convert an uppercase character into a lowercase character.",
          "Write a program to solve quadratic equations using if, else if, and else.",
          "Write a program to find the number of days in a given month.",
          "Write a program to check whether a character is lowercase or not.",
          "Write a program to check whether a character is uppercase or not.",
          "Write a program to check whether a character is an alphabet or not.",
          "Write a program to check whether a character is a digit or not.",
          "Write a program to check whether a character is a vowel or not.",
          "Write a program to check whether a character is a consonant or not.",
          "Write a program to check whether a character is a vowel or consonant.",
          "Write a program to check whether a character is an alphabet, digit, or special character."
        ]
      },
      {
        "name": "Loop Programs",
        "questions": [
          "Write a program to print numbers from 1 to 10 using a for loop.",
          "Write a program to print even numbers from 1 to 100.",
          "Write a program to calculate the sum of first N natural numbers.",
          "Write a program to print the multiplication table of a given number.",
          "Write a program to reverse a given number using a loop.",
          "Write a program to print all odd numbers between 1 and 50.",
          "Write a program to find the factorial of a number using a loop.",
          "Write a program to print characters from 'A' to 'Z' using a loop.",
          "Write a program to check whether a number is a palindrome.",
          "Write a program to find the sum of digits of a given number.",
          "Write a program to check whether a number is an Armstrong number.",
          "Write a program to check whether a number is a Strong number.",
          "Write a program to count the number of digits without converting to String.",
          "Write a program to print all prime numbers up to N using loops.",
          "Write a program to find the largest digit in a number using a loop."
        ]
      },
      {
        "name": "Array Programming Problems",
        "questions": [
          "Given an unsorted array of integers and a target sum, write a program to find a subarray whose elements add up to the given sum.",
          "Given an array of integers and a target sum, write a program to find all pairs of elements whose sum equals the target value.",
          "Write a program to find the majority element in an array (an element that appears more than n/2 times).",
          "Given an array of integers, write a program to reverse the array elements.",
          "Write a program to find the maximum and minimum elements in an array of integers.",
          "Given an array of integers, write a program to calculate the sum of all its elements.",
          "Write a program to left-rotate an array by one position.",
          "Write a program to right-rotate an array by one position.",
          "Given an array of integers, write a program to find the second largest element.",
          "Write a program to check whether a given array is sorted in ascending order.",
          "Write a program to find duplicate elements in an array of integers.",
          "Given two arrays, write a program to find the intersection of both arrays.",
          "Write a program to move all zero elements in an array to the end while maintaining the order of non-zero elements.",
          "Given an array containing n distinct numbers in the range 0 to n, write a program to find the missing number.",
          "Write a program to calculate the average of elements in an array.",
          "Write a program to find the maximum and minimum values in an array.",
          "Write a program to count the number of even and odd elements in an array."
        ]
      },
      {
        "name": "String Programming Problems",
        "questions": [
          "Write a program to reverse a given string.",
          "Write a program to check whether a given string is a palindrome.",
          "Write a program to count the occurrences of a specific character in a string.",
          "Write a program to find duplicate characters in a string.",
          "Write a program to remove duplicate characters from a string.",
          "Write a program to check whether two strings are anagrams of each other.",
          "Write a program to find the first non-repeated character in a string.",
          "Write a program to check whether a string contains only digits.",
          "Write a program to count the number of vowels and consonants in a string.",
          "Write a program to check whether one string is a rotation of another string.",
          "Write a program to find the longest word in a given sentence.",
          "Write a program to convert a string into Title Case.",
          "Write a program to find all permutations of a given string.",
          "Write a program to convert a string into an integer without using Integer.parseInt().",
          "Write a program to find the frequency of each word in a sentence.",
          "Write a program to convert a string into a char array without using toCharArray().",
          "Write a program to remove all non-alphabetic characters from a string.",
          "Write a program to convert lowercase letters to uppercase without using toUpperCase().",
          "Write a program to reverse the words in a sentence.",
          "Write a program to check whether two strings are one edit distance apart.",
          "Write a program to implement the strStr() function to find the index of a substring.",
          "Write a program to compress a string (for example, aaabb becomes a3b2).",
          "Write a program to find the longest common prefix in an array of strings.",
          "Write a program to implement isSubstring() without using the contains() method.",
          "Write a program to print all possible substrings of a string.",
          "Write a program to convert a number into words (for example, 123 → One Hundred Twenty Three).",
          "Write a program to validate an email address format.",
          "Write a program to convert a CamelCase string into snake_case.",
          "Write a program to find the lexicographically smallest string from a set of strings.",
          "Write a program to remove consecutive duplicate words from a sentence."
        ]
      },
      {
        "name": "Basic StringBuilder Programs",
        "questions": [
          "Write a program to append a string to an existing StringBuilder object.",
          "Write a program to insert a substring at a specific position using StringBuilder.",
          "Write a program to replace a part of a string using StringBuilder.",
          "Write a program to delete specific characters from a string using StringBuilder.",
          "Write a program to reverse a string using StringBuilder.",
          "Write a program to find and display the length and capacity of a StringBuilder object.",
          "Write a program to ensure a minimum capacity for a StringBuilder object.",
          "Write a program to trim the capacity of a StringBuilder to its actual size using trimToSize().",
          "Write a program to set or change a character at a given index using StringBuilder.",
          "Write a program to extract a substring from a StringBuilder object."
        ]
      },
      {
        "name": "StringBuffer-Specific Programs",
        "questions": [
          "Write a program to reverse a string in a thread-safe manner using StringBuffer.",
          "Write a program to append strings synchronously in a multi-threaded environment using StringBuffer.",
          "Write a program to compare the performance of StringBuilder and StringBuffer while appending large strings.",
          "Write a program to build a string recursively using StringBuffer.",
          "Write a program to construct a JSON-like string using StringBuffer."
        ]
      },
      {
        "name": "OOPS Based Programs",
        "questions": [
          "Write a program to demonstrate a class and object with basic attributes and methods.",
          "Write a program to demonstrate encapsulation using private variables and public getters/setters.",
          "Write a program to demonstrate single inheritance.",
          "Write a program to demonstrate multilevel inheritance.",
          "Write a program to demonstrate hierarchical inheritance.",
          "Write a program to demonstrate method overloading (compile-time polymorphism).",
          "Write a program to demonstrate method overriding (runtime polymorphism).",
          "Write a program to demonstrate abstraction using an abstract class.",
          "Write a program to demonstrate abstraction using an interface.",
          "Write a program to demonstrate multiple inheritance using interfaces.",
          "Write a program to demonstrate the use of the this keyword.",
          "Write a program to demonstrate the use of the super keyword.",
          "Write a program to demonstrate constructor overloading.",
          "Write a program to demonstrate static members in OOPS.",
          "Write a program to demonstrate final keyword with variable, method, and class.",
          "Write a program to demonstrate runtime polymorphism using method overriding.",
          "Write a program to demonstrate object passing to a method.",
          "Write a program to demonstrate aggregation (HAS-A relationship).",
          "Write a program to demonstrate composition in OOPS.",
          "Write a program to demonstrate upcasting and downcasting."
        ]
      },
      {
        "name": "Exception Handling – try, catch, finally",
        "questions": [
          "Write a Java program that accepts two integers and divides them. Handle the situation when the divisor is zero using try and catch.",
          "Create an array of size 5. Ask the user to enter an index and print the element. Handle ArrayIndexOutOfBoundsException.",
          "Read a string from the user and convert it into an integer. Handle NumberFormatException if the string is not a valid number.",
          "Accept two numbers as strings, convert them to integers, and divide them. Handle NumberFormatException and ArithmeticException using multiple catch blocks.",
          "Write a program that opens a file (assume logic) and uses finally to display \"Resource closed\" whether an exception occurs or not.",
          "Write a Bank Withdrawal program where if withdrawal amount is greater than balance, throw an exception and catch it to print a proper message.",
          "Declare a String as null and try to find its length. Handle NullPointerException.",
          "Write a program to validate student marks. If marks are less than 0 or greater than 100, throw an exception and handle it.",
          "Write a program using nested try-catch where an array access and division are performed. Handle both errors separately.",
          "Write a program that divides two numbers and uses finally to print \"Operation completed\".",
          "Read an integer using Scanner. If the user enters a string, handle InputMismatchException.",
          "Write a program for password validation. If password length is less than 8 characters, throw an exception and catch it.",
          "Write a voting system program. If age is less than 18, throw an exception; otherwise print \"Eligible to Vote\".",
          "Write a program that tries to open a file that does not exist. Handle the exception and use finally to print \"Program ended\".",
          "Create a calculator program that performs division. Handle invalid input and division by zero."
        ]
      },
      {
        "name": "Exception Handling using throw (Manual Exception Creation)",
        "questions": [
          "Write a program that throws IllegalArgumentException if the entered age is less than 0.",
          "If withdrawal amount is greater than balance, throw ArithmeticException with message \"Insufficient balance\".",
          "If student marks are less than 0 or greater than 100, throw a custom exception InvalidMarksException.",
          "Accept two numbers. If the second number is zero, throw ArithmeticException manually using throw.",
          "If password length is less than 8, throw RuntimeException with a custom message.",
          "If name is null, throw NullPointerException explicitly using throw.",
          "If age is less than 18, throw Exception with message \"Not eligible to vote\"."
        ]
      },
      {
        "name": "Exception Handling using throws (Exception Propagation)",
        "questions": [
          "Create a method that reads a file and declares throws IOException. Handle the exception in main().",
          "Write a method that calls Thread.sleep() and uses throws InterruptedException instead of try-catch.",
          "Create a method that may cause ArithmeticException and ArrayIndexOutOfBoundsException and declare both using throws.",
          "Create three methods where the lowest method throws IOException, the middle method declares throws, and main handles the exception.",
          "Create a custom exception LowSalaryException. If salary is less than 15000, throw the exception and declare it using throws.",
          "Create a Bank Account program where withdraw() throws InsufficientBalanceException and declares it using throws.",
          "Write a login validation program where a method throws LoginFailedException if username or password is incorrect and handle it in main().",
          "Write a program to demonstrate re-throwing an exception: catch it, print a message, then re-throw it using throw and handle it in the caller method using throws."
        ]
      },
      {
        "name": "Linked List Programs",
        "questions": [
          "Write a Java program to append the specified element to the end of a linked list.",
          "Write a Java program to iterate through all elements in a linked list.",
          "Write a Java program to iterate through all elements in a linked list starting at a specified position.",
          "Write a Java program to iterate a linked list in reverse order.",
          "Write a Java program to insert the specified element at a given position in a linked list.",
          "Write a Java program to insert elements at the first and last positions of a linked list.",
          "Write a Java program to insert the specified element at the front of a linked list.",
          "Write a Java program to insert the specified element at the end of a linked list.",
          "Write a Java program to insert multiple elements at a specified position in a linked list.",
          "Write a Java program to get the first and last occurrence of a specified element in a linked list.",
          "Write a Java program to display elements and their positions in a linked list.",
          "Write a Java program to remove a specified element from a linked list.",
          "Write a Java program to remove the first and last elements from a linked list.",
          "Write a Java program to remove all elements from a linked list.",
          "Write a Java program to swap two elements in a linked list.",
          "Write a Java program to shuffle elements in a linked list.",
          "Write a Java program to join two linked lists.",
          "Write a Java program to copy one linked list to another.",
          "Write a Java program to remove and return the first element of a linked list.",
          "Write a Java program to retrieve but not remove the first element of a linked list.",
          "Write a Java program to retrieve but not remove the last element of a linked list.",
          "Write a Java program to check if a specific element exists in a linked list.",
          "Write a Java program to convert a linked list to an ArrayList.",
          "Write a Java program to compare two linked lists.",
          "Write a Java program to check whether a linked list is empty or not.",
          "Write a Java program to replace an element in a linked list."
        ]
      },
      {
        "name": "ArrayList Programs",
        "questions": [
          "Create a List<Integer>, add five elements, and print them.",
          "Insert an element at a specific index in a list.",
          "Update an element at index 2 in a list.",
          "Remove an element at index 3 from a list.",
          "Remove a specific element by value from a list.",
          "Retrieve the first and last elements from a list.",
          "Check if a given element exists in a list.",
          "Find the size of a list.",
          "Iterate a list using for loop, for-each loop, and Iterator.",
          "Convert an array into a list and print it.",
          "Convert a list into an array and print it.",
          "Create a list of strings and sort it in ascending order.",
          "Sort a list of integers in descending order.",
          "Reverse a list without using Collections.reverse().",
          "Merge two lists and display the result.",
          "Remove duplicate elements from a list without using Set.",
          "Find maximum and minimum values in a list.",
          "Count the frequency of a given element in a list.",
          "Shuffle the elements of a list randomly.",
          "Compare two lists for equality."
        ]
      },
      {
        "name": "Stack Programs",
        "questions": [
          "Implement a stack using an array with push, pop, peek, and isEmpty operations.",
          "Implement a stack using Java Stack class and perform push, pop, peek, search, and display operations.",
          "Write a program to check whether a stack is empty.",
          "Push N elements into a stack using user input.",
          "Pop all elements from a stack until it becomes empty.",
          "Find the top element of a stack without removing it.",
          "Count the number of elements present in a stack.",
          "Search for an element in a stack.",
          "Reverse a stack using another stack.",
          "Copy elements from one stack to another without changing order.",
          "Reverse a string using stack.",
          "Check whether a string is a palindrome using stack.",
          "Convert a decimal number to binary using stack.",
          "Print stack elements without modifying the stack.",
          "Find the minimum element in a stack.",
          "Find the maximum element in a stack.",
          "Insert an element at the bottom of a stack without using loops.",
          "Sort a stack using another stack.",
          "Remove the middle element from a stack.",
          "Check for balanced parentheses using stack.",
          "Evaluate a postfix expression using stack.",
          "Convert infix expression to postfix using stack.",
          "Design a Min Stack that supports getMin() in O(1) time."
        ]
      },
      {
        "name": "Queue Programs",
        "questions": [
          "Implement a queue using an array and perform enqueue, dequeue, peek, and display operations.",
          "Implement a queue using LinkedList in Java.",
          "Check whether a queue is empty or full.",
          "Insert N elements into a queue and display them in FIFO order.",
          "Remove all elements from a queue one by one and print them.",
          "Find the front and rear elements of a queue without removing them.",
          "Count the number of elements in a queue.",
          "Write a menu-driven program to perform queue operations using switch-case.",
          "Copy all elements from one queue to another.",
          "Reverse a queue using another queue.",
          "Implement a circular queue using an array.",
          "Reverse a queue using a stack.",
          "Implement a queue using two stacks.",
          "Sort a queue in ascending order.",
          "Find the maximum and minimum elements in a queue.",
          "Implement a deque and perform insert and delete operations at both ends."
        ]
      },
      {
        "name": "Comparable and Comparator Problems",
        "questions": [
          "Sort students by roll number using Comparable.",
          "Sort students by name using Comparator.",
          "Sort employees by salary in descending order.",
          "Sort products by price in ascending order.",
          "Sort books by page count using Comparable.",
          "Sort cities by population using Comparator.",
          "Sort movies by rating in descending order.",
          "Sort students by marks in descending order.",
          "Sort players by age from youngest to oldest.",
          "Sort orders by order date (oldest first).",
          "Sort cars by mileage in descending order.",
          "Sort students by name and then by marks.",
          "Sort laptops by price and then by brand.",
          "Sort bank accounts by balance in descending order.",
          "Sort employees by department and salary.",
          "Sort cricket players by runs in descending order.",
          "Sort mobile phones by RAM size.",
          "Sort students by CGPA in descending order."
        ]
      },
      {
        "name": "Serialization & Deserialization",
        "questions": [
          "Write a Java program to serialize an object of a Student class containing id, name, and marks into a file.",
          "Write a Java program to deserialize a Student object from a file and print its details.",
          "Create a class that does not implement Serializable and try to serialize its object. Observe and explain the exception thrown.",
          "Create another class without implementing Serializable and attempt serialization to understand the Serializable interface requirement.",
          "Write a program to demonstrate the use of the transient keyword by serializing a class with a transient password field and verifying its value after deserialization."
        ]
      }

      ]
    },
    {
      "name": "Python",
      "description": "Practice Python essentials, data structures, and clean logic building.",
      "topics": [
        {
          "name": "Operator Problems",
          "questions": [
            "Add two numbers.",
            "Subtract two numbers.",
            "Multiply two numbers.",
            "Divide two numbers.",
            "Find the modulo of two numbers.",
            "Calculate the area of a circle using the formula πr².",
            "Calculate simple interest using the formula (P × R × T) / 100.",
            "Calculate compound interest.",
            "Calculate the average of three numbers.",
            "Convert temperature from Celsius to Fahrenheit.",

            "Demonstrate pre-increment and post-increment.",
            "Demonstrate pre-decrement and post-decrement.",
            "Swap two numbers using + and - operators.",
            "Swap two numbers using * and / operators.",
            "Convert a positive number to negative and vice versa using unary minus (-).",

            "Check if two numbers are equal.",
            "Check if one number is greater than another.",
            "Check if a number lies within a given range.",
            "Compare three numbers and find the largest.",
            "Check if a number is smaller than all other given numbers.",
            "Check if a character is uppercase or lowercase.",
            "Validate a password length using >= operator.",
            "Determine exam pass or fail status based on marks.",
            "Check if a number is even using modulo and comparison operators.",
            "Check if a number is a three-digit number.",

            "Check if a number lies between 10 and 50 using &&.",
            "Check if a year is a leap year using multiple logical conditions.",
            "Check if a character is a vowel or consonant using ||.",
            "Validate login credentials using correct username and password with &&.",
            "Check if a number is divisible by both 3 and 5.",
            "Determine if a number is either positive or even.",
            "Determine if a number is valid and divisible by 10.",
            "Use logical NOT (!) to reverse a boolean condition.",
            "Check if a number is not in a given range.",
            "Perform a multiple-condition check using both && and || together.",

            "Use += to sum all values in a loop.",
            "Use *= to calculate the power of a number.",
            "Use /= to repeatedly reduce a number by half.",
            "Use -= to perform a countdown from a number.",
            "Use %= to extract the last digit of a number iteratively.",
            "Use combined assignment operators in a single expression.",
            "Build a calculator using only compound assignment operators.",
            "Perform matrix addition using += operator.",
            "Calculate the cumulative total of array elements.",
            "Build a table of squares using *= operator.",

            "Check whether a number is even or odd using the ternary operator.",
            "Find the maximum of two numbers using ternary operator.",
            "Find the maximum of three numbers using nested ternary operator.",
            "Print \"Pass\" or \"Fail\" based on marks using ternary operator.",
            "Assign grade based on score using chained ternary operator.",
            "Find the smallest of two numbers using ternary operator.",
            "Check whether a year is a leap year using ternary operator.",
            "Print whether a number is positive, negative, or zero using ternary operator.",
            "Determine voting eligibility using ternary operator.",
            "Return \"YES\" or \"NO\" if a number is divisible by 7 using ternary operator."
          ]
        },
        {
          "name": "Conditionl statements ",
          "questions": [
            "Write a program to accept two integers and check whether they are equal or not.",
            "Write a program to check whether a number is divisible by another number or not.",
            "Write a program to determine whether a person is eligible for casting a vote or not.",
            "Write a program to check whether a number is even or odd.",
            "Write a program to check whether a number is even or odd without using if-else.",
            "Write a program to check whether a number is positive, negative, or zero.",
            "Write a program to check which number is bigger among two numbers.",
            "Write a program to check which number is bigger among three numbers.",
            "Write a Java program to check whether a year is a leap year or not.",
            "Write a program to check whether a number is a Buzz number or not.",
            "Write a program to check whether a person is a kid, teenager, adult, or old age based on age.",
            "Write a Java program to display the weekday name based on numbers from 1 to 7.",
            "Write a program to display a wish message to the user based on the current time.",
            "Write a program to display pass or fail based on marks.",
            "Write a program to display a suitable message according to the temperature state.",
            "Write a program to calculate price per copy and total price for printed copies based on quantity slabs.",
            "Write a program to check whether an entered character is lowercase (a–z) or uppercase (A–Z).",
            "Write a program to convert a lowercase character into an uppercase character.",
            "Write a program to convert an uppercase character into a lowercase character.",
            "Write a Java program to solve quadratic equations using if, else-if, and else.",
            "Write a Java program to find the number of days in a given month.",
            "Write a program to check whether a character is lowercase using ASCII values.",
            "Write a program to check whether a character is uppercase using ASCII values.",
            "Write a program to check whether a character is an alphabet.",
            "Write a program to check whether a character is a digit.",
            "Write a program to check whether a character is a vowel.",
            "Write a program to check whether a character is a consonant.",
            "Write a program to check whether a character is a vowel or consonant.",
            "Write a program to check whether a character is an alphabet, digit, or special character."
          ]
        },

        {
          "name": "While Loop  Problems ",
          "questions": [
            "Print numbers from 1 to 10 using a while loop.",
            "Print numbers from 10 to 1 using a while loop.",
            "Print all even numbers between 1 and 20.",
            "Print all odd numbers between 1 and 20.",
            "Print the first 10 natural numbers.",
            "Print numbers from 1 to N (N given by the user).",
            "Print the multiplication table of a number using while.",
            "Find the sum of numbers from 1 to 10.",
            "Find the sum of first N natural numbers.",
            "Print all numbers divisible by 5 between 1 and 50.",

            "Count the number of digits in a given number.",
            "Find the sum of digits of a number.",
            "Reverse a given number.",
            "Check whether a number is a palindrome.",
            "Find the product of digits of a number.",
            "Find the factorial of a number using while.",
            "Print all factors of a given number.",
            "Find the largest digit in a given number.",

            "Print numbers from 5 to 50 with a gap of 5 using while.",
            "Print numbers between 1 and 100 that end with digit 7.",
            "Print numbers from 1 to 30 except multiples of 3.",
            "Print squares of numbers from 1 to 10.",
            "Print cubes of numbers from 1 to 10.",
            "Print the ASCII values of characters from A to Z.",
            "Print numbers from 1 to 100 but stop when the number reaches 37.",
            "Print numbers from 1 to 20, skipping even numbers.",
            "Print numbers between 50 and 100 that are divisible by 4.",
            "Print the first N even numbers using while.",

            "Count how many even digits are present in a number.",
            "Count how many odd digits are present in a number.",
            "Find the sum of even digits of a number.",
            "Find the sum of odd digits of a number.",
            "Check whether a number contains the digit 0.",
            "Check whether a number contains a specific digit D.",
            "Remove all zeroes from a number.",
            "Count how many times a digit D appears in a number.",
            "Find the smallest digit in a number.",
            "Swap the first and last digit of a number.",

            "Print all numbers between 1 and N whose digit sum is even.",
            "Print all numbers between 1 and 100 that contain digit 3.",
            "Check whether a number is a Duck Number (contains zero).",
            "Check whether a number is a Harshad Number.",
            "Generate the Fibonacci series up to N terms using while.",
            "Find the power of a number without using Math.pow().",
            "Convert a decimal number to binary using while.",
            "Convert a decimal number to octal using while.",
            "Find the GCD of two numbers using while."
          ]
        },
        {
          "name": "Python For Loop Programs",
          "questions": [
            "Print numbers from 1 to 10 using a for loop.",
            "Print numbers from 10 to 1 using a for loop.",
            "Print all even numbers between 1 and 20.",
            "Print all odd numbers between 1 and 20.",
            "Print the first N natural numbers.",
            "Print the multiplication table of a number.",
            "Find the sum of numbers from 1 to 10.",
            "Find the sum of first N natural numbers.",
            "Print all numbers divisible by 5 between 1 and 50.",
            "Print squares of numbers from 1 to 10.",
            "Count the number of vowels in a string.",
            "Count the number of consonants in a string.",
            "Find the sum of all elements in a list.",
            "Find the largest and smallest elements in a list.",
            "Count even and odd numbers in a list."
          ]
        },
        {
          "name": "Python String Programming Problems",
          "questions": [
            "Write a Python program to reverse a given string.",
            "Write a Python program to check whether a given string is a palindrome.",
            "Write a Python program to count the occurrences of a specific character in a string.",
            "Write a Python program to find duplicate characters in a string.",
            "Write a Python program to remove duplicate characters from a string.",
            "Write a Python program to check whether two strings are anagrams of each other.",
            "Write a Python program to find the first non-repeated character in a string.",
            "Write a Python program to check whether a string contains only digits.",
            "Write a Python program to count the number of vowels and consonants in a string.",
            "Write a Python program to check whether one string is a rotation of another string.",
            "Write a Python program to find the longest word in a given sentence.",
            "Write a Python program to convert a string into Title Case.",
            "Write a Python program to find all permutations of a given string.",
            "Write a Python program to convert a string into an integer without using int().",
            "Write a Python program to find the frequency of each word in a sentence.",
            "Write a Python program to convert a string into a character list without using list().",
            "Write a Python program to remove all non-alphabetic characters from a string.",
            "Write a Python program to convert lowercase letters to uppercase without using upper().",
            "Write a Python program to reverse the words in a sentence.",
            "Write a Python program to check whether two strings are one edit distance apart.",
            "Write a Python program to implement substring search without using the in keyword.",
            "Write a Python program to compress a string (for example, aaabb becomes a3b2).",
            "Write a Python program to find the longest common prefix in a list of strings.",
            "Write a Python program to check if one string is a substring of another without using built-in methods.",
            "Write a Python program to print all possible substrings of a string.",
            "Write a Python program to convert a number into words (for example, 123 → One Hundred Twenty Three).",
            "Write a Python program to validate an email address format.",
            "Write a Python program to convert a CamelCase string into snake_case.",
            "Write a Python program to find the lexicographically smallest string from a list of strings.",
            "Write a Python program to remove consecutive duplicate words from a sentence."
          ]
        },
        {
          "name": "Functions",
          "questions": [
            "Explain positional vs keyword arguments.",
            "What is a lambda function used for?",
            "How do you return multiple values from a function?"
          ]
        }
      ]
    },
    {
      "name": "HTML",
      "description": "Strengthen your semantic HTML and layout foundations.",
      "topics": [
        {
          "name": "Structure",
          "questions": [
            "Why is semantic HTML important?",
            "Explain the difference between block and inline elements.",
            "How do you create a basic form in HTML?"
          ]
        },
        {
          "name": "Media",
          "questions": [
            "How do you embed audio and video in HTML?",
            "What are the advantages of using the picture element?",
            "How do you add accessible images?"
          ]
        },
        {
          "name": "Tables",
          "questions": [
            "How do you merge table cells?",
            "What is the difference between th and td?",
            "How do you make a table responsive?"
          ]
        }
      ]
    },
    {
      "name": "CSS",
      "description": "Practice styling, layouts, and responsive techniques.",
      "topics": [
        {
          "name": "Selectors",
          "questions": [
            "What is the difference between class and id selectors?",
            "How does specificity work in CSS?",
            "Explain pseudo-classes with examples."
          ]
        },
        {
          "name": "Layouts",
          "questions": [
            "When would you use Flexbox over Grid?",
            "How do you center an element vertically and horizontally?",
            "What is the box model in CSS?"
          ]
        },
        {
          "name": "Responsive",
          "questions": [
            "How do media queries work?",
            "What units are best for responsive typography?",
            "How do you create a mobile-first layout?"
          ]
        }
      ]
    },
    {
      "name": "JavaScript",
      "description": "Practice core JavaScript, DOM interactions, and logic building.",
      "topics": [
        {
          "name": "Basics",
          "questions": [
            "Explain the difference between let, const, and var.",
            "How does hoisting work in JavaScript?",
            "What are truthy and falsy values?"
          ]
        },
        {
          "name": "Arrays & Objects",
          "questions": [
            "How do you clone an array or object safely?",
            "Explain the difference between map, filter, and reduce.",
            "How would you remove duplicates from an array?"
          ]
        },
        {
          "name": "DOM",
          "questions": [
            "What is event delegation?",
            "How do you select and update DOM elements?",
            "Explain the difference between innerText and innerHTML."
          ]
        }
      ]
    }
  ]
}
