{
    "name":  "Python",
    "description":  "Practice Python essentials, data structures, and clean logic building.",
    "topics":  [
                   {
                       "name":  "Operator Problems",
                       "questions":  [
                                         "Add two numbers.",
                                         "Subtract two numbers.",
                                         "Multiply two numbers.",
                                         "Divide two numbers.",
                                         "Find the modulo of two numbers.",
                                         "Calculate the area of a circle using the formula πr².",
                                         "Calculate simple interest using the formula (P × R × T) / 100.",
                                         "Calculate compound interest.",
                                         "Calculate the average of three numbers.",
                                         "Convert temperature from Celsius to Fahrenheit.",
                                         "Demonstrate pre-increment and post-increment.",
                                         "Demonstrate pre-decrement and post-decrement.",
                                         "Swap two numbers using + and - operators.",
                                         "Swap two numbers using * and / operators.",
                                         "Convert a positive number to negative and vice versa using unary minus (-).",
                                         "Check if two numbers are equal.",
                                         "Check if one number is greater than another.",
                                         "Check if a number lies within a given range.",
                                         "Compare three numbers and find the largest.",
                                         "Check if a number is smaller than all other given numbers.",
                                         "Check if a character is uppercase or lowercase.",
                                         "Validate a password length using \u003e= operator.",
                                         "Determine exam pass or fail status based on marks.",
                                         "Check if a number is even using modulo and comparison operators.",
                                         "Check if a number is a three-digit number.",
                                         "Check if a number lies between 10 and 50 using \u0026\u0026.",
                                         "Check if a year is a leap year using multiple logical conditions.",
                                         "Check if a character is a vowel or consonant using ||.",
                                         "Validate login credentials using correct username and password with \u0026\u0026.",
                                         "Check if a number is divisible by both 3 and 5.",
                                         "Determine if a number is either positive or even.",
                                         "Determine if a number is valid and divisible by 10.",
                                         "Use logical NOT (!) to reverse a boolean condition.",
                                         "Check if a number is not in a given range.",
                                         "Perform a multiple-condition check using both \u0026\u0026 and || together.",
                                         "Use += to sum all values in a loop.",
                                         "Use *= to calculate the power of a number.",
                                         "Use /= to repeatedly reduce a number by half.",
                                         "Use -= to perform a countdown from a number.",
                                         "Use %= to extract the last digit of a number iteratively.",
                                         "Use combined assignment operators in a single expression.",
                                         "Build a calculator using only compound assignment operators.",
                                         "Perform matrix addition using += operator.",
                                         "Calculate the cumulative total of array elements.",
                                         "Build a table of squares using *= operator.",
                                         "Check whether a number is even or odd using the ternary operator.",
                                         "Find the maximum of two numbers using ternary operator.",
                                         "Find the maximum of three numbers using nested ternary operator.",
                                         "Print \"Pass\" or \"Fail\" based on marks using ternary operator.",
                                         "Assign grade based on score using chained ternary operator.",
                                         "Find the smallest of two numbers using ternary operator.",
                                         "Check whether a year is a leap year using ternary operator.",
                                         "Print whether a number is positive, negative, or zero using ternary operator.",
                                         "Determine voting eligibility using ternary operator.",
                                         "Return \"YES\" or \"NO\" if a number is divisible by 7 using ternary operator."
                                     ]
                   },
                   {
                       "name":  "Conditionl statements ",
                       "questions":  [
                                         "Write a program to accept two integers and check whether they are equal or not.",
                                         "Write a program to check whether a number is divisible by another number or not.",
                                         "Write a program to determine whether a person is eligible for casting a vote or not.",
                                         "Write a program to check whether a number is even or odd.",
                                         "Write a program to check whether a number is even or odd without using if-else.",
                                         "Write a program to check whether a number is positive, negative, or zero.",
                                         "Write a program to check which number is bigger among two numbers.",
                                         "Write a program to check which number is bigger among three numbers.",
                                         "Write a Java program to check whether a year is a leap year or not.",
                                         "Write a program to check whether a number is a Buzz number or not.",
                                         "Write a program to check whether a person is a kid, teenager, adult, or old age based on age.",
                                         "Write a Java program to display the weekday name based on numbers from 1 to 7.",
                                         "Write a program to display a wish message to the user based on the current time.",
                                         "Write a program to display pass or fail based on marks.",
                                         "Write a program to display a suitable message according to the temperature state.",
                                         "Write a program to calculate price per copy and total price for printed copies based on quantity slabs.",
                                         "Write a program to check whether an entered character is lowercase (a–z) or uppercase (A–Z).",
                                         "Write a program to convert a lowercase character into an uppercase character.",
                                         "Write a program to convert an uppercase character into a lowercase character.",
                                         "Write a Java program to solve quadratic equations using if, else-if, and else.",
                                         "Write a Java program to find the number of days in a given month.",
                                         "Write a program to check whether a character is lowercase using ASCII values.",
                                         "Write a program to check whether a character is uppercase using ASCII values.",
                                         "Write a program to check whether a character is an alphabet.",
                                         "Write a program to check whether a character is a digit.",
                                         "Write a program to check whether a character is a vowel.",
                                         "Write a program to check whether a character is a consonant.",
                                         "Write a program to check whether a character is a vowel or consonant.",
                                         "Write a program to check whether a character is an alphabet, digit, or special character."
                                     ]
                   },
                   {
                       "name":  "While Loop  Problems ",
                       "questions":  [
                                         "Print numbers from 1 to 10 using a while loop.",
                                         "Print numbers from 10 to 1 using a while loop.",
                                         "Print all even numbers between 1 and 20.",
                                         "Print all odd numbers between 1 and 20.",
                                         "Print the first 10 natural numbers.",
                                         "Print numbers from 1 to N (N given by the user).",
                                         "Print the multiplication table of a number using while.",
                                         "Find the sum of numbers from 1 to 10.",
                                         "Find the sum of first N natural numbers.",
                                         "Print all numbers divisible by 5 between 1 and 50.",
                                         "Count the number of digits in a given number.",
                                         "Find the sum of digits of a number.",
                                         "Reverse a given number.",
                                         "Check whether a number is a palindrome.",
                                         "Find the product of digits of a number.",
                                         "Find the factorial of a number using while.",
                                         "Print all factors of a given number.",
                                         "Find the largest digit in a given number.",
                                         "Print numbers from 5 to 50 with a gap of 5 using while.",
                                         "Print numbers between 1 and 100 that end with digit 7.",
                                         "Print numbers from 1 to 30 except multiples of 3.",
                                         "Print squares of numbers from 1 to 10.",
                                         "Print cubes of numbers from 1 to 10.",
                                         "Print the ASCII values of characters from A to Z.",
                                         "Print numbers from 1 to 100 but stop when the number reaches 37.",
                                         "Print numbers from 1 to 20, skipping even numbers.",
                                         "Print numbers between 50 and 100 that are divisible by 4.",
                                         "Print the first N even numbers using while.",
                                         "Count how many even digits are present in a number.",
                                         "Count how many odd digits are present in a number.",
                                         "Find the sum of even digits of a number.",
                                         "Find the sum of odd digits of a number.",
                                         "Check whether a number contains the digit 0.",
                                         "Check whether a number contains a specific digit D.",
                                         "Remove all zeroes from a number.",
                                         "Count how many times a digit D appears in a number.",
                                         "Find the smallest digit in a number.",
                                         "Swap the first and last digit of a number.",
                                         "Print all numbers between 1 and N whose digit sum is even.",
                                         "Print all numbers between 1 and 100 that contain digit 3.",
                                         "Check whether a number is a Duck Number (contains zero).",
                                         "Check whether a number is a Harshad Number.",
                                         "Generate the Fibonacci series up to N terms using while.",
                                         "Find the power of a number without using Math.pow().",
                                         "Convert a decimal number to binary using while.",
                                         "Convert a decimal number to octal using while.",
                                         "Find the GCD of two numbers using while."
                                     ]
                   },
                   {
                       "name":  "Python For Loop Programs",
                       "questions":  [
                                         "Print numbers from 1 to 10 using a for loop.",
                                         "Print numbers from 10 to 1 using a for loop.",
                                         "Print all even numbers between 1 and 20.",
                                         "Print all odd numbers between 1 and 20.",
                                         "Print the first N natural numbers.",
                                         "Print the multiplication table of a number.",
                                         "Find the sum of numbers from 1 to 10.",
                                         "Find the sum of first N natural numbers.",
                                         "Print all numbers divisible by 5 between 1 and 50.",
                                         "Print squares of numbers from 1 to 10.",
                                         "Count the number of vowels in a string.",
                                         "Count the number of consonants in a string.",
                                         "Find the sum of all elements in a list.",
                                         "Find the largest and smallest elements in a list.",
                                         "Count even and odd numbers in a list."
                                     ]
                   },
                   {
                       "name":  "Python String Programming Problems",
                       "questions":  [
                                         "Write a Python program to reverse a given string.",
                                         "Write a Python program to check whether a given string is a palindrome.",
                                         "Write a Python program to count the occurrences of a specific character in a string.",
                                         "Write a Python program to find duplicate characters in a string.",
                                         "Write a Python program to remove duplicate characters from a string.",
                                         "Write a Python program to check whether two strings are anagrams of each other.",
                                         "Write a Python program to find the first non-repeated character in a string.",
                                         "Write a Python program to check whether a string contains only digits.",
                                         "Write a Python program to count the number of vowels and consonants in a string.",
                                         "Write a Python program to check whether one string is a rotation of another string.",
                                         "Write a Python program to find the longest word in a given sentence.",
                                         "Write a Python program to convert a string into Title Case.",
                                         "Write a Python program to find all permutations of a given string.",
                                         "Write a Python program to convert a string into an integer without using int().",
                                         "Write a Python program to find the frequency of each word in a sentence.",
                                         "Write a Python program to convert a string into a character list without using list().",
                                         "Write a Python program to remove all non-alphabetic characters from a string.",
                                         "Write a Python program to convert lowercase letters to uppercase without using upper().",
                                         "Write a Python program to reverse the words in a sentence.",
                                         "Write a Python program to check whether two strings are one edit distance apart.",
                                         "Write a Python program to implement substring search without using the in keyword.",
                                         "Write a Python program to compress a string (for example, aaabb becomes a3b2).",
                                         "Write a Python program to find the longest common prefix in a list of strings.",
                                         "Write a Python program to check if one string is a substring of another without using built-in methods.",
                                         "Write a Python program to print all possible substrings of a string.",
                                         "Write a Python program to convert a number into words (for example, 123 → One Hundred Twenty Three).",
                                         "Write a Python program to validate an email address format.",
                                         "Write a Python program to convert a CamelCase string into snake_case.",
                                         "Write a Python program to find the lexicographically smallest string from a list of strings.",
                                         "Write a Python program to remove consecutive duplicate words from a sentence."
                                     ]
                   },
                   {
                       "name":  "Functions",
                       "questions":  [
                                         "Explain positional vs keyword arguments.",
                                         "What is a lambda function used for?",
                                         "How do you return multiple values from a function?"
                                     ]
                   }
               ]
}
